Merge pull request #316 from state-alchemists/feat/update-diagram
Update diagram
